const arrayOfLoveWishes = [
   "Нехай кожен день приносить радість і тепло!",
   "Бажаю гармонії та світла у твоєму житті!",
   "Нехай щастя завжди буде поруч!",
   "Хай твоє серце наповнюється любов’ю і добром!",
   "Нехай удача завжди супроводжує тебе!",
   "Бажаю натхнення та здійснення мрій!",
   "Нехай кожен день буде сповнений приємних моментів!",
   "Хай мир і злагода панують у твоєму серці!",
   "Бажаю тобі сил та енергії для нових звершень!",
   "Нехай у твоєму житті завжди буде багато щасливих моментів!",
   "Кохання нехай зігріває твоє серце завжди!",
   "Ти гідний(а) найщирішого та найтеплішого кохання!",
   "Нехай любов буде яскравою і вічною!",
   "Хай кожен погляд коханої людини дарує радість!",
   "Нехай ваше кохання буде міцним і безмежним!",
   "Щастя вам у кожній спільній миті!",
   "Нехай ваші серця б'ються в унісон!",
   "Любов нехай приносить гармонію і щастя!",
   "Нехай ваші обійми будуть найтеплішими!",
   "Хай почуття ніколи не згасають, а лише міцнішають!"
];

document.getElementById('btn_love_wishes').addEventListener('click', () => {    
   let index = Math.floor(Math.random() * arrayOfLoveWishes.length)
   document.getElementById('p-love-wishes').innerText = arrayOfLoveWishes[index]
})





